research/res.org
* Research

[[https://scholar.google.com/citations?hl=en&user=cryX_isAAAAJ][Google Scholar]], [[https://dblp.org/pid/157/4803.html][DBLP]]

[[https://www.doi2bib.org/][DOI → BibTeX]]

*** Covering Simple Orthogonal Polygons with Rectangles
- DOI: [[https://doi.org/10.4230/LIPIcs.APPROX/RANDOM.2025.2]]

*** Packing Fréchet Balls
- with /Peyman Afshani/
- [[https://dccg.upc.edu/eurocg23/wp-content/uploads/2023/03/Session-9A-Talk-2.pdf][Workshop version]]

*** On Range Summary Queries
- with /Peyman Afshani, Pingan Cheng, and Zhewei Wei/
- DOI: https://doi.org/10.4230/LIPIcs.ICALP.2023.7 

*** Approximating Robust Bin Packing with Budgeted Uncertainty 
- with /Marin Bougeret, Noam Goldberg, and Michael Poss/
- DOI: https://doi.org/10.1007/978-3-030-24766-9_6

***  Local Search Strikes Again: PTAS for Variants of Geometric Covering and Packing.
- with /Pradeesha Ashok and Sathish Govindarajan/
- DOI: https://doi.org/10.1007/s10878-019-00432-y
- [[https://doi.org/10.1007/978-3-319-62389-4_3][Preliminary version]]

*** Packing and Covering with Non-Piercing Regions
- with /Sathish Govindarajan, Rajiv Raman, and Saurabh Ray/ 
- DOI: https://doi.org/10.1007/s00454-018-9983-2
- [[https://doi.org/10.4230/LIPIcs.ESA.2016.47][Preliminary version]]

*** Effectiveness of Local Search for Art Gallery Problems
- with /Sayan Bandyapadhyay/
- DOI: https://doi.org/10.1007/978-3-319-62127-2_5 

*** Demand Hitting and Covering of Intervals
- with /Datta Krupa R., Minati De, and Sathish Govindarajan/ 
- DOI: https://doi.org/10.1007/978-3-319-53007-9_24

*** On the d-Runaway Rectangle Escape Problem
- with /Sathish Govindarajan, Neeldhara Misra, and Shreyas Shetty/
- [[http://www.cccg.ca/proceedings/2014/papers/paper43.pdf][Conference version]]
- [[https://arxiv.org/abs/1603.04210][Expanded version, also with /Anil Maheshwari and Subhas C Nandy/]]
  


