research/res.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-05 Sun 19:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org8d77798" class="outline-2">
<h2 id="org8d77798">Research</h2>
<div class="outline-text-2" id="text-org8d77798">
<p>
<a href="https://scholar.google.com/citations?hl=en&amp;user=cryX_isAAAAJ">Google Scholar</a>, <a href="https://dblp.org/pid/157/4803.html">DBLP</a>
</p>

<p>
<a href="https://www.doi2bib.org/">DOI → BibTeX</a>
</p>
</div>
<div id="outline-container-org0923905" class="outline-4">
<h4 id="org0923905">Covering Simple Orthogonal Polygons with Rectangles</h4>
<div class="outline-text-4" id="text-org0923905">
<ul class="org-ul">
<li>DOI: <a href="https://doi.org/10.4230/LIPIcs.APPROX/RANDOM.2025.2">https://doi.org/10.4230/LIPIcs.APPROX/RANDOM.2025.2</a></li>
</ul>
</div>
</div>
<div id="outline-container-org00fdfe7" class="outline-4">
<h4 id="org00fdfe7">Packing Fréchet Balls</h4>
<div class="outline-text-4" id="text-org00fdfe7">
<ul class="org-ul">
<li>with <i>Peyman Afshani</i></li>
<li><a href="https://dccg.upc.edu/eurocg23/wp-content/uploads/2023/03/Session-9A-Talk-2.pdf">Workshop version</a></li>
</ul>
</div>
</div>
<div id="outline-container-org73fb874" class="outline-4">
<h4 id="org73fb874">On Range Summary Queries</h4>
<div class="outline-text-4" id="text-org73fb874">
<ul class="org-ul">
<li>with <i>Peyman Afshani, Pingan Cheng, and Zhewei Wei</i></li>
<li>DOI: <a href="https://doi.org/10.4230/LIPIcs.ICALP.2023.7">https://doi.org/10.4230/LIPIcs.ICALP.2023.7</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7291e48" class="outline-4">
<h4 id="org7291e48">Approximating Robust Bin Packing with Budgeted Uncertainty</h4>
<div class="outline-text-4" id="text-org7291e48">
<ul class="org-ul">
<li>with <i>Marin Bougeret, Noam Goldberg, and Michael Poss</i></li>
<li>DOI: <a href="https://doi.org/10.1007/978-3-030-24766-9_6">https://doi.org/10.1007/978-3-030-24766-9_6</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf458741" class="outline-4">
<h4 id="orgf458741">Local Search Strikes Again: PTAS for Variants of Geometric Covering and Packing.</h4>
<div class="outline-text-4" id="text-orgf458741">
<ul class="org-ul">
<li>with <i>Pradeesha Ashok and Sathish Govindarajan</i></li>
<li>DOI: <a href="https://doi.org/10.1007/s10878-019-00432-y">https://doi.org/10.1007/s10878-019-00432-y</a></li>
<li><a href="https://doi.org/10.1007/978-3-319-62389-4_3">Preliminary version</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbf2d8ac" class="outline-4">
<h4 id="orgbf2d8ac">Packing and Covering with Non-Piercing Regions</h4>
<div class="outline-text-4" id="text-orgbf2d8ac">
<ul class="org-ul">
<li>with <i>Sathish Govindarajan, Rajiv Raman, and Saurabh Ray</i></li>
<li>DOI: <a href="https://doi.org/10.1007/s00454-018-9983-2">https://doi.org/10.1007/s00454-018-9983-2</a></li>
<li><a href="https://doi.org/10.4230/LIPIcs.ESA.2016.47">Preliminary version</a></li>
</ul>
</div>
</div>
<div id="outline-container-org172a15d" class="outline-4">
<h4 id="org172a15d">Effectiveness of Local Search for Art Gallery Problems</h4>
<div class="outline-text-4" id="text-org172a15d">
<ul class="org-ul">
<li>with <i>Sayan Bandyapadhyay</i></li>
<li>DOI: <a href="https://doi.org/10.1007/978-3-319-62127-2_5">https://doi.org/10.1007/978-3-319-62127-2_5</a></li>
</ul>
</div>
</div>
<div id="outline-container-org10c019f" class="outline-4">
<h4 id="org10c019f">Demand Hitting and Covering of Intervals</h4>
<div class="outline-text-4" id="text-org10c019f">
<ul class="org-ul">
<li>with <i>Datta Krupa R., Minati De, and Sathish Govindarajan</i></li>
<li>DOI: <a href="https://doi.org/10.1007/978-3-319-53007-9_24">https://doi.org/10.1007/978-3-319-53007-9_24</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf673830" class="outline-4">
<h4 id="orgf673830">On the d-Runaway Rectangle Escape Problem</h4>
<div class="outline-text-4" id="text-orgf673830">
<ul class="org-ul">
<li>with <i>Sathish Govindarajan, Neeldhara Misra, and Shreyas Shetty</i></li>
<li><a href="http://www.cccg.ca/proceedings/2014/papers/paper43.pdf">Conference version</a></li>
<li><a href="https://arxiv.org/abs/1603.04210">Expanded version, also with <i>Anil Maheshwari and Subhas C Nandy</i></a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-10-05 Sun 19:26</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
